# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

backbone:
  [
   [-1, 1, Silence, []],
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2  320  64
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4  160  128
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3
   [-1, 1, ADown, [256]],  # 4-P3/8     80  256
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5
   [-1, 1, ADown, [512]],  # 6-P4/16   40  512
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 7
  ]

head:
  [
   [-1, 1, SPPELAN, [512, 256]],  #    40  512

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 80  512
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4  # 80  1024
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  #  80  512

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 160  512
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3  160  768
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 160  256


   # multi-level reversible auxiliary branch
   # routing
   [3, 1, CBLinear, [[256]]], # 23
   [5, 1, CBLinear, [[256, 512]]], # 24
   [7, 1, CBLinear, [[256, 512, 512]]], # 25

   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 26-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 27-P2/4

   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 28

   [-1, 1, ADown, [256]],  # 29-P3/8
   [[15, 16, 17, -1], 1, CBFuse, [[0, 0, 0]]], # 30
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 31

   [-1, 1, ADown, [512]],  # 32-P4/16
   [[16, 17, -1], 1, CBFuse, [[1, 1]]], # 33
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 34

   [-1, 1, ADown, [512]],  # 35-P5/32
   [[17, -1], 1, CBFuse, [[2]]], # 36
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 37

   [[23, 26, 29, 11, 14], 1, Detect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)

  ]
